tutorials/rheoBDFoam/LAOE/constant/initMoleculesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
groups
(
    G1
    {
        nMolecules   500;
        
        // Physical properties
        D            0.065e-12; 
        a            .077e-6;  
        Nks          19.81132075;             
        nuEV         1.2e-21;    
        Ls           2.1e-6;     
        
        spatialDistibutionCoeffs
         {
            p0              (-2.1e-6 0 0); 
            p1              (2.1e-6 0 0); 
          
            branches
            (
                  (0 0 11) ( 0.1  0. 0. ) (false true)
            );
            
         }       
    }     
);
 
// ************************************************************************* //
